# IsKeySchedule Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleDefinition..::..IsKeySchedule Property
ScheduleDefinition Class See Also
---
Indicates if the schedule is a key schedule.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsKeySchedule { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsKeySchedule As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsKeySchedule {
	bool get ();
}
```

# Remarks
A key schedule displays abstract "key" elements that can be used to populate parameters of ordinary model elements.
# See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace